zephyrproject-rtos/hal_infineon/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/gpio_psoc6_04_80_m_csp.h
    /* P2.6 */
    P2_6_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_6_TCPWM0_LINE2               =  8,       /* Digital Active - tcpwm[0].line[2]:1 */
    P2_6_TCPWM0_LINE262             =  9,       /* Digital Active - tcpwm[0].line[262]:0 */
    P2_6_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:15 */
    P2_6_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:15 */
    P2_6_LCD_COM12                  = 12,       /* Digital Deep Sleep - lcd.com[12]:0 */
    P2_6_LCD_SEG12                  = 13,       /* Digital Deep Sleep - lcd.seg[12]:0 */
    P2_6_LPCOMP_DSI_COMP0           = 15,       /* Digital Deep Sleep - lpcomp.dsi_comp0:0 */
    P2_6_SCB1_SPI_SELECT3           = 20,       /* Digital Active - scb[1].spi_select3:1 */
    P2_6_TCPWM0_TR_ONE_CNT_IN3      = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[3]:1 */
    P2_6_PERI_TR_IO_INPUT8          = 24,       /* Digital Active - peri.tr_io_input[8]:0 */

    /* P2.7 */
    P2_7_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_7_TCPWM0_LINE_COMPL2         =  8,       /* Digital Active - tcpwm[0].line_compl[2]:1 */
    P2_7_TCPWM0_LINE_COMPL262       =  9,       /* Digital Active - tcpwm[0].line_compl[262]:0 */
    P2_7_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:16 */
    P2_7_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:16 */
    P2_7_LCD_COM13                  = 12,       /* Digital Deep Sleep - lcd.com[13]:0 */
    P2_7_LCD_SEG13                  = 13,       /* Digital Deep Sleep - lcd.seg[13]:0 */
    P2_7_LPCOMP_DSI_COMP1           = 15,       /* Digital Deep Sleep - lpcomp.dsi_comp1:0 */
    P2_7_TCPWM0_TR_ONE_CNT_IN256    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[256]:1 */
    P2_7_PERI_TR_IO_INPUT9          = 24,       /* Digital Active - peri.tr_io_input[9]:0 */

    /* P3.0 */
    P3_0_GPIO                       =  0,       /* GPIO controls 'out' */
    P3_0_TCPWM0_LINE3               =  8,       /* Digital Active - tcpwm[0].line[3]:1 */
    P3_0_TCPWM0_LINE263             =  9,       /* Digital Active - tcpwm[0].line[263]:0 */
    P3_0_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:17 */
    P3_0_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:17 */
    P3_0_LCD_COM14                  = 12,       /* Digital Deep Sleep - lcd.com[14]:0 */
    P3_0_LCD_SEG14                  = 13,       /* Digital Deep Sleep - lcd.seg[14]:0 */
    P3_0_SCB2_UART_RX               = 18,       /* Digital Active - scb[2].uart_rx:1 */
    P3_0_SCB2_I2C_SCL               = 19,       /* Digital Active - scb[2].i2c_scl:1 */
    P3_0_TCPWM0_TR_ONE_CNT_IN257    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[257]:1 */
    P3_0_PERI_TR_IO_INPUT6          = 24,       /* Digital Active - peri.tr_io_input[6]:0 */

    /* P3.1 */
    P3_1_GPIO                       =  0,       /* GPIO controls 'out' */
    P3_1_TCPWM0_LINE_COMPL3         =  8,       /* Digital Active - tcpwm[0].line_compl[3]:1 */
    P3_1_TCPWM0_LINE_COMPL263       =  9,       /* Digital Active - tcpwm[0].line_compl[263]:0 */
    P3_1_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:18 */
    P3_1_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:18 */
    P3_1_LCD_COM15                  = 12,       /* Digital Deep Sleep - lcd.com[15]:0 */
    P3_1_LCD_SEG15                  = 13,       /* Digital Deep Sleep - lcd.seg[15]:0 */
    P3_1_SCB2_UART_TX               = 18,       /* Digital Active - scb[2].uart_tx:1 */
    P3_1_SCB2_I2C_SDA               = 19,       /* Digital Active - scb[2].i2c_sda:1 */
    P3_1_TCPWM0_TR_ONE_CNT_IN258    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[258]:1 */
    P3_1_PERI_TR_IO_INPUT7          = 24,       /* Digital Active - peri.tr_io_input[7]:0 */

    /* P5.0 */
    P5_0_GPIO                       =  0,       /* GPIO controls 'out' */
    P5_0_TCPWM0_LINE0               =  8,       /* Digital Active - tcpwm[0].line[0]:2 */
    P5_0_TCPWM0_LINE256             =  9,       /* Digital Active - tcpwm[0].line[256]:1 */
    P5_0_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:19 */
    P5_0_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:19 */
    P5_0_LCD_COM16                  = 12,       /* Digital Deep Sleep - lcd.com[16]:0 */
    P5_0_LCD_SEG16                  = 13,       /* Digital Deep Sleep - lcd.seg[16]:0 */
    P5_0_SCB5_UART_RX               = 18,       /* Digital Active - scb[5].uart_rx:0 */
    P5_0_SCB5_I2C_SCL               = 19,       /* Digital Active - scb[5].i2c_scl:0 */
    P5_0_SCB5_SPI_MOSI              = 20,       /* Digital Active - scb[5].spi_mosi:0 */
    P5_0_CANFD0_TTCAN_RX0           = 22,       /* Digital Active - canfd[0].ttcan_rx[0] */
    P5_0_TCPWM0_TR_ONE_CNT_IN259    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[259]:1 */
    P5_0_PERI_TR_IO_INPUT10         = 24,       /* Digital Active - peri.tr_io_input[10]:0 */

    /* P5.1 */
    P5_1_GPIO                       =  0,       /* GPIO controls 'out' */
    P5_1_TCPWM0_LINE_COMPL0         =  8,       /* Digital Active - tcpwm[0].line_compl[0]:2 */
    P5_1_TCPWM0_LINE_COMPL256       =  9,       /* Digital Active - tcpwm[0].line_compl[256]:1 */
    P5_1_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:20 */
    P5_1_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:20 */
    P5_1_LCD_COM17                  = 12,       /* Digital Deep Sleep - lcd.com[17]:0 */
    P5_1_LCD_SEG17                  = 13,       /* Digital Deep Sleep - lcd.seg[17]:0 */
    P5_1_SCB5_UART_TX               = 18,       /* Digital Active - scb[5].uart_tx:0 */
    P5_1_SCB5_I2C_SDA               = 19,       /* Digital Active - scb[5].i2c_sda:0 */
    P5_1_SCB5_SPI_MISO              = 20,       /* Digital Active - scb[5].spi_miso:0 */
    P5_1_CANFD0_TTCAN_TX0           = 22,       /* Digital Active - canfd[0].ttcan_tx[0] */
    P5_1_TCPWM0_TR_ONE_CNT_IN260    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[260]:1 */
    P5_1_PERI_TR_IO_INPUT11         = 24,       /* Digital Active - peri.tr_io_input[11]:0 */

    /* P5.2 */
    P5_2_GPIO                       =  0,       /* GPIO controls 'out' */
    P5_2_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:21 */
    P5_2_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:21 */
    P5_2_TCPWM0_TR_ONE_CNT_IN261    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[261]:1 */

