zephyrproject-rtos/hal_infineon/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/gpio_psoc6_04_80_m_csp.h
    /* P5.6 */
    P5_6_GPIO                       =  0,       /* GPIO controls 'out' */
    P5_6_TCPWM0_LINE1               =  8,       /* Digital Active - tcpwm[0].line[1]:2 */
    P5_6_TCPWM0_LINE257             =  9,       /* Digital Active - tcpwm[0].line[257]:1 */
    P5_6_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:22 */
    P5_6_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:22 */
    P5_6_LCD_COM18                  = 12,       /* Digital Deep Sleep - lcd.com[18]:0 */
    P5_6_LCD_SEG18                  = 13,       /* Digital Deep Sleep - lcd.seg[18]:0 */
    P5_6_TCPWM0_TR_ONE_CNT_IN262    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[262]:1 */

    /* P5.7 */
    P5_7_GPIO                       =  0,       /* GPIO controls 'out' */
    P5_7_TCPWM0_LINE_COMPL1         =  8,       /* Digital Active - tcpwm[0].line_compl[1]:2 */
    P5_7_TCPWM0_LINE_COMPL257       =  9,       /* Digital Active - tcpwm[0].line_compl[257]:1 */
    P5_7_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:23 */
    P5_7_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:23 */
    P5_7_LCD_COM19                  = 12,       /* Digital Deep Sleep - lcd.com[19]:0 */
    P5_7_LCD_SEG19                  = 13,       /* Digital Deep Sleep - lcd.seg[19]:0 */
    P5_7_TCPWM0_TR_ONE_CNT_IN263    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[263]:1 */

    /* P6.2 */
    P6_2_GPIO                       =  0,       /* GPIO controls 'out' */
    P6_2_TCPWM0_LINE3               =  8,       /* Digital Active - tcpwm[0].line[3]:2 */
    P6_2_TCPWM0_LINE259             =  9,       /* Digital Active - tcpwm[0].line[259]:1 */
    P6_2_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:24 */
    P6_2_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:24 */
    P6_2_LCD_COM22                  = 12,       /* Digital Deep Sleep - lcd.com[22]:0 */
    P6_2_LCD_SEG22                  = 13,       /* Digital Deep Sleep - lcd.seg[22]:0 */
    P6_2_TCPWM0_TR_ONE_CNT_IN0      = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[0]:2 */
    P6_2_CPUSS_FAULT_OUT0           = 25,       /* Digital Active - cpuss.fault_out[0] */

    /* P6.3 */
    P6_3_GPIO                       =  0,       /* GPIO controls 'out' */
    P6_3_TCPWM0_LINE_COMPL3         =  8,       /* Digital Active - tcpwm[0].line_compl[3]:2 */
    P6_3_TCPWM0_LINE_COMPL259       =  9,       /* Digital Active - tcpwm[0].line_compl[259]:1 */
    P6_3_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:25 */
    P6_3_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:25 */
    P6_3_LCD_COM23                  = 12,       /* Digital Deep Sleep - lcd.com[23]:0 */
    P6_3_LCD_SEG23                  = 13,       /* Digital Deep Sleep - lcd.seg[23]:0 */
    P6_3_TCPWM0_TR_ONE_CNT_IN1      = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[1]:2 */
    P6_3_CPUSS_FAULT_OUT1           = 25,       /* Digital Active - cpuss.fault_out[1] */

    /* P6.4 */
    P6_4_GPIO                       =  0,       /* GPIO controls 'out' */
    P6_4_TCPWM0_LINE0               =  8,       /* Digital Active - tcpwm[0].line[0]:3 */
    P6_4_TCPWM0_LINE260             =  9,       /* Digital Active - tcpwm[0].line[260]:1 */
    P6_4_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:26 */
    P6_4_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:26 */
    P6_4_LCD_COM24                  = 12,       /* Digital Deep Sleep - lcd.com[24]:0 */
    P6_4_LCD_SEG24                  = 13,       /* Digital Deep Sleep - lcd.seg[24]:0 */
    P6_4_SCB6_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[6].i2c_scl:0 */
    P6_4_TCPWM0_TR_ONE_CNT_IN2      = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[2]:2 */
    P6_4_PERI_TR_IO_INPUT12         = 24,       /* Digital Active - peri.tr_io_input[12]:0 */
    P6_4_PERI_TR_IO_OUTPUT0         = 25,       /* Digital Active - peri.tr_io_output[0]:1 */
    P6_4_CPUSS_SWJ_SWO_TDO          = 29,       /* Digital Deep Sleep - cpuss.swj_swo_tdo */
    P6_4_SCB6_SPI_MOSI              = 30,       /* Digital Deep Sleep - scb[6].spi_mosi:0 */
    P6_4_SRSS_DDFT_PIN_IN0          = 31,       /* Digital Deep Sleep - srss.ddft_pin_in[0]:0 */

    /* P6.5 */
    P6_5_GPIO                       =  0,       /* GPIO controls 'out' */
    P6_5_TCPWM0_LINE_COMPL0         =  8,       /* Digital Active - tcpwm[0].line_compl[0]:3 */
    P6_5_TCPWM0_LINE_COMPL260       =  9,       /* Digital Active - tcpwm[0].line_compl[260]:1 */
    P6_5_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:27 */
    P6_5_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:27 */
    P6_5_LCD_COM25                  = 12,       /* Digital Deep Sleep - lcd.com[25]:0 */
    P6_5_LCD_SEG25                  = 13,       /* Digital Deep Sleep - lcd.seg[25]:0 */
    P6_5_SCB6_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[6].i2c_sda:0 */
    P6_5_TCPWM0_TR_ONE_CNT_IN3      = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[3]:2 */
    P6_5_PERI_TR_IO_INPUT13         = 24,       /* Digital Active - peri.tr_io_input[13]:0 */
    P6_5_PERI_TR_IO_OUTPUT1         = 25,       /* Digital Active - peri.tr_io_output[1]:1 */
    P6_5_CPUSS_SWJ_SWDOE_TDI        = 29,       /* Digital Deep Sleep - cpuss.swj_swdoe_tdi */
    P6_5_SCB6_SPI_MISO              = 30,       /* Digital Deep Sleep - scb[6].spi_miso:0 */
    P6_5_SRSS_DDFT_PIN_IN1          = 31,       /* Digital Deep Sleep - srss.ddft_pin_in[1]:0 */

    /* P6.6 */
    P6_6_GPIO                       =  0,       /* GPIO controls 'out' */
    P6_6_TCPWM0_LINE1               =  8,       /* Digital Active - tcpwm[0].line[1]:3 */
    P6_6_TCPWM0_LINE261             =  9,       /* Digital Active - tcpwm[0].line[261]:1 */
    P6_6_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:28 */
    P6_6_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:28 */
    P6_6_LCD_COM26                  = 12,       /* Digital Deep Sleep - lcd.com[26]:0 */
    P6_6_LCD_SEG26                  = 13,       /* Digital Deep Sleep - lcd.seg[26]:0 */
    P6_6_TCPWM0_TR_ONE_CNT_IN256    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[256]:2 */
    P6_6_CPUSS_SWJ_SWDIO_TMS        = 29,       /* Digital Deep Sleep - cpuss.swj_swdio_tms */
    P6_6_SCB6_SPI_CLK               = 30,       /* Digital Deep Sleep - scb[6].spi_clk:0 */

    /* P6.7 */
    P6_7_GPIO                       =  0,       /* GPIO controls 'out' */
    P6_7_TCPWM0_LINE_COMPL1         =  8,       /* Digital Active - tcpwm[0].line_compl[1]:3 */
    P6_7_TCPWM0_LINE_COMPL261       =  9,       /* Digital Active - tcpwm[0].line_compl[261]:1 */
    P6_7_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:29 */
    P6_7_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:29 */
    P6_7_LCD_COM27                  = 12,       /* Digital Deep Sleep - lcd.com[27]:0 */
    P6_7_LCD_SEG27                  = 13,       /* Digital Deep Sleep - lcd.seg[27]:0 */
    P6_7_TCPWM0_TR_ONE_CNT_IN257    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[257]:2 */
    P6_7_CPUSS_SWJ_SWCLK_TCLK       = 29,       /* Digital Deep Sleep - cpuss.swj_swclk_tclk */
    P6_7_SCB6_SPI_SELECT0           = 30,       /* Digital Deep Sleep - scb[6].spi_select0:0 */

    /* P7.0 */
    P7_0_GPIO                       =  0,       /* GPIO controls 'out' */
    P7_0_AMUXA                      =  4,       /* Analog mux bus A */
    P7_0_AMUXB                      =  5,       /* Analog mux bus B */
    P7_0_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P7_0_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P7_0_TCPWM0_LINE2               =  8,       /* Digital Active - tcpwm[0].line[2]:2 */
    P7_0_TCPWM0_LINE262             =  9,       /* Digital Active - tcpwm[0].line[262]:1 */
    P7_0_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:30 */
    P7_0_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:30 */
    P7_0_LCD_COM28                  = 12,       /* Digital Deep Sleep - lcd.com[28]:0 */
    P7_0_LCD_SEG28                  = 13,       /* Digital Deep Sleep - lcd.seg[28]:0 */
    P7_0_SCB4_UART_RX               = 18,       /* Digital Active - scb[4].uart_rx:0 */
    P7_0_SCB4_I2C_SCL               = 19,       /* Digital Active - scb[4].i2c_scl:0 */
    P7_0_SCB4_SPI_MOSI              = 20,       /* Digital Active - scb[4].spi_mosi:0 */
    P7_0_TCPWM0_TR_ONE_CNT_IN258    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[258]:2 */
    P7_0_PERI_TR_IO_INPUT14         = 24,       /* Digital Active - peri.tr_io_input[14]:0 */
    P7_0_CPUSS_TRACE_CLOCK          = 26,       /* Digital Active - cpuss.trace_clock */

    /* P7.1 */
    P7_1_GPIO                       =  0,       /* GPIO controls 'out' */
    P7_1_AMUXA                      =  4,       /* Analog mux bus A */
    P7_1_AMUXB                      =  5,       /* Analog mux bus B */
    P7_1_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P7_1_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P7_1_TCPWM0_LINE_COMPL2         =  8,       /* Digital Active - tcpwm[0].line_compl[2]:2 */
    P7_1_TCPWM0_LINE_COMPL262       =  9,       /* Digital Active - tcpwm[0].line_compl[262]:1 */
    P7_1_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:31 */
    P7_1_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:31 */
    P7_1_LCD_COM29                  = 12,       /* Digital Deep Sleep - lcd.com[29]:0 */
    P7_1_LCD_SEG29                  = 13,       /* Digital Deep Sleep - lcd.seg[29]:0 */
    P7_1_SCB4_UART_TX               = 18,       /* Digital Active - scb[4].uart_tx:0 */
    P7_1_SCB4_I2C_SDA               = 19,       /* Digital Active - scb[4].i2c_sda:0 */
    P7_1_SCB4_SPI_MISO              = 20,       /* Digital Active - scb[4].spi_miso:0 */
    P7_1_TCPWM0_TR_ONE_CNT_IN259    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[259]:2 */
    P7_1_PERI_TR_IO_INPUT15         = 24,       /* Digital Active - peri.tr_io_input[15]:0 */

