zephyrproject-rtos/hal_infineon/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/gpio_psoc6_04_80_m_csp.h
    /* P9.2 */
    P9_2_GPIO                       =  0,       /* GPIO controls 'out' */
    P9_2_AMUXA                      =  4,       /* Analog mux bus A */
    P9_2_AMUXB                      =  5,       /* Analog mux bus B */
    P9_2_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P9_2_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P9_2_TCPWM0_LINE1               =  8,       /* Digital Active - tcpwm[0].line[1]:4 */
    P9_2_TCPWM0_LINE261             =  9,       /* Digital Active - tcpwm[0].line[261]:2 */
    P9_2_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:41 */
    P9_2_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:41 */
    P9_2_LCD_COM42                  = 12,       /* Digital Deep Sleep - lcd.com[42]:0 */
    P9_2_LCD_SEG42                  = 13,       /* Digital Deep Sleep - lcd.seg[42]:0 */
    P9_2_SCB2_UART_RTS              = 18,       /* Digital Active - scb[2].uart_rts:0 */
    P9_2_SCB2_SPI_CLK               = 20,       /* Digital Active - scb[2].spi_clk:0 */
    P9_2_PASS_DSI_CTB_CMP0          = 22,       /* Digital Active - pass.dsi_ctb_cmp0:1 */
    P9_2_TCPWM0_TR_ONE_CNT_IN257    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[257]:3 */
    P9_2_CPUSS_TRACE_DATA1          = 27,       /* Digital Active - cpuss.trace_data[1]:1 */

    /* P9.3 */
    P9_3_GPIO                       =  0,       /* GPIO controls 'out' */
    P9_3_AMUXA                      =  4,       /* Analog mux bus A */
    P9_3_AMUXB                      =  5,       /* Analog mux bus B */
    P9_3_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P9_3_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P9_3_TCPWM0_LINE_COMPL1         =  8,       /* Digital Active - tcpwm[0].line_compl[1]:4 */
    P9_3_TCPWM0_LINE_COMPL261       =  9,       /* Digital Active - tcpwm[0].line_compl[261]:3 */
    P9_3_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:42 */
    P9_3_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:42 */
    P9_3_LCD_COM43                  = 12,       /* Digital Deep Sleep - lcd.com[43]:0 */
    P9_3_LCD_SEG43                  = 13,       /* Digital Deep Sleep - lcd.seg[43]:0 */
    P9_3_SCB2_UART_CTS              = 18,       /* Digital Active - scb[2].uart_cts:0 */
    P9_3_SCB2_SPI_SELECT0           = 20,       /* Digital Active - scb[2].spi_select0:0 */
    P9_3_PASS_DSI_CTB_CMP1          = 22,       /* Digital Active - pass.dsi_ctb_cmp1:1 */
    P9_3_TCPWM0_TR_ONE_CNT_IN258    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[258]:3 */
    P9_3_CPUSS_TRACE_DATA0          = 27,       /* Digital Active - cpuss.trace_data[0]:1 */
    P9_3_SRSS_DDFT_PIN_IN1          = 31,       /* Digital Deep Sleep - srss.ddft_pin_in[1]:1 */

    /* P9.4 */
    P9_4_GPIO                       =  0,       /* GPIO controls 'out' */
    P9_4_AMUXA                      =  4,       /* Analog mux bus A */
    P9_4_AMUXB                      =  5,       /* Analog mux bus B */
    P9_4_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P9_4_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P9_4_TCPWM0_LINE256             =  9,       /* Digital Active - tcpwm[0].line[256]:3 */
    P9_4_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:43 */
    P9_4_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:43 */
    P9_4_SCB2_SPI_SELECT1           = 20,       /* Digital Active - scb[2].spi_select1:0 */
    P9_4_TCPWM0_TR_ONE_CNT_IN259    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[259]:3 */

    /* P9.5 */
    P9_5_GPIO                       =  0,       /* GPIO controls 'out' */
    P9_5_AMUXA                      =  4,       /* Analog mux bus A */
    P9_5_AMUXB                      =  5,       /* Analog mux bus B */
    P9_5_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P9_5_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P9_5_TCPWM0_LINE_COMPL256       =  9,       /* Digital Active - tcpwm[0].line_compl[256]:3 */
    P9_5_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:44 */
    P9_5_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:44 */
    P9_5_SCB2_SPI_SELECT2           = 20,       /* Digital Active - scb[2].spi_select2:0 */
    P9_5_TCPWM0_TR_ONE_CNT_IN260    = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[260]:3 */

    /* P10.0 */
    P10_0_GPIO                      =  0,       /* GPIO controls 'out' */
    P10_0_AMUXA                     =  4,       /* Analog mux bus A */
    P10_0_AMUXB                     =  5,       /* Analog mux bus B */
    P10_0_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P10_0_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P10_0_TCPWM0_LINE2              =  8,       /* Digital Active - tcpwm[0].line[2]:4 */
    P10_0_TCPWM0_LINE262            =  9,       /* Digital Active - tcpwm[0].line[262]:2 */
    P10_0_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:45 */
    P10_0_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:45 */
    P10_0_LCD_COM44                 = 12,       /* Digital Deep Sleep - lcd.com[44]:0 */
    P10_0_LCD_SEG44                 = 13,       /* Digital Deep Sleep - lcd.seg[44]:0 */
    P10_0_SCB1_UART_RX              = 18,       /* Digital Active - scb[1].uart_rx:0 */
    P10_0_SCB1_I2C_SCL              = 19,       /* Digital Active - scb[1].i2c_scl:0 */
    P10_0_SCB1_SPI_MOSI             = 20,       /* Digital Active - scb[1].spi_mosi:0 */
    P10_0_TCPWM0_TR_ONE_CNT_IN261   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[261]:3 */
    P10_0_PERI_TR_IO_INPUT20        = 24,       /* Digital Active - peri.tr_io_input[20]:0 */
    P10_0_CPUSS_TRACE_DATA3         = 27,       /* Digital Active - cpuss.trace_data[3]:0 */

    /* P10.1 */
    P10_1_GPIO                      =  0,       /* GPIO controls 'out' */
    P10_1_AMUXA                     =  4,       /* Analog mux bus A */
    P10_1_AMUXB                     =  5,       /* Analog mux bus B */
    P10_1_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P10_1_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P10_1_TCPWM0_LINE_COMPL2        =  8,       /* Digital Active - tcpwm[0].line_compl[2]:4 */
    P10_1_TCPWM0_LINE_COMPL262      =  9,       /* Digital Active - tcpwm[0].line_compl[262]:2 */
    P10_1_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:46 */
    P10_1_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:46 */
    P10_1_LCD_COM45                 = 12,       /* Digital Deep Sleep - lcd.com[45]:0 */
    P10_1_LCD_SEG45                 = 13,       /* Digital Deep Sleep - lcd.seg[45]:0 */
    P10_1_SCB1_UART_TX              = 18,       /* Digital Active - scb[1].uart_tx:0 */
    P10_1_SCB1_I2C_SDA              = 19,       /* Digital Active - scb[1].i2c_sda:0 */
    P10_1_SCB1_SPI_MISO             = 20,       /* Digital Active - scb[1].spi_miso:0 */
    P10_1_TCPWM0_TR_ONE_CNT_IN262   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[262]:3 */
    P10_1_PERI_TR_IO_INPUT21        = 24,       /* Digital Active - peri.tr_io_input[21]:0 */
    P10_1_CPUSS_TRACE_DATA2         = 27,       /* Digital Active - cpuss.trace_data[2]:0 */

