zephyrproject-rtos/hal_infineon/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/gpio_psoc6_04_80_m_csp.h
    /* P10.2 */
    P10_2_GPIO                      =  0,       /* GPIO controls 'out' */
    P10_2_AMUXA                     =  4,       /* Analog mux bus A */
    P10_2_AMUXB                     =  5,       /* Analog mux bus B */
    P10_2_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P10_2_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P10_2_TCPWM0_LINE3              =  8,       /* Digital Active - tcpwm[0].line[3]:4 */
    P10_2_TCPWM0_LINE263            =  9,       /* Digital Active - tcpwm[0].line[263]:2 */
    P10_2_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:47 */
    P10_2_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:47 */
    P10_2_LCD_COM46                 = 12,       /* Digital Deep Sleep - lcd.com[46]:0 */
    P10_2_LCD_SEG46                 = 13,       /* Digital Deep Sleep - lcd.seg[46]:0 */
    P10_2_SCB1_UART_RTS             = 18,       /* Digital Active - scb[1].uart_rts:0 */
    P10_2_SCB1_SPI_CLK              = 20,       /* Digital Active - scb[1].spi_clk:0 */
    P10_2_TCPWM0_TR_ONE_CNT_IN263   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[263]:3 */
    P10_2_CPUSS_TRACE_DATA1         = 27,       /* Digital Active - cpuss.trace_data[1]:0 */

    /* P10.3 */
    P10_3_GPIO                      =  0,       /* GPIO controls 'out' */
    P10_3_AMUXA                     =  4,       /* Analog mux bus A */
    P10_3_AMUXB                     =  5,       /* Analog mux bus B */
    P10_3_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P10_3_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P10_3_TCPWM0_LINE_COMPL3        =  8,       /* Digital Active - tcpwm[0].line_compl[3]:4 */
    P10_3_TCPWM0_LINE_COMPL263      =  9,       /* Digital Active - tcpwm[0].line_compl[263]:2 */
    P10_3_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:48 */
    P10_3_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:48 */
    P10_3_LCD_COM47                 = 12,       /* Digital Deep Sleep - lcd.com[47]:0 */
    P10_3_LCD_SEG47                 = 13,       /* Digital Deep Sleep - lcd.seg[47]:0 */
    P10_3_SCB1_UART_CTS             = 18,       /* Digital Active - scb[1].uart_cts:0 */
    P10_3_SCB1_SPI_SELECT0          = 20,       /* Digital Active - scb[1].spi_select0:0 */
    P10_3_TCPWM0_TR_ONE_CNT_IN0     = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[0]:4 */
    P10_3_CPUSS_TRACE_DATA0         = 27,       /* Digital Active - cpuss.trace_data[0]:0 */

    /* P10.4 */
    P10_4_GPIO                      =  0,       /* GPIO controls 'out' */
    P10_4_AMUXA                     =  4,       /* Analog mux bus A */
    P10_4_AMUXB                     =  5,       /* Analog mux bus B */
    P10_4_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P10_4_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P10_4_TCPWM0_LINE0              =  8,       /* Digital Active - tcpwm[0].line[0]:5 */
    P10_4_TCPWM0_LINE256            =  9,       /* Digital Active - tcpwm[0].line[256]:2 */
    P10_4_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:49 */
    P10_4_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:49 */
    P10_4_LCD_COM48                 = 12,       /* Digital Deep Sleep - lcd.com[48]:0 */
    P10_4_LCD_SEG48                 = 13,       /* Digital Deep Sleep - lcd.seg[48]:0 */
    P10_4_SCB1_SPI_SELECT1          = 20,       /* Digital Active - scb[1].spi_select1:0 */
    P10_4_TCPWM0_TR_ONE_CNT_IN1     = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[1]:4 */

    /* P10.5 */
    P10_5_GPIO                      =  0,       /* GPIO controls 'out' */
    P10_5_AMUXA                     =  4,       /* Analog mux bus A */
    P10_5_AMUXB                     =  5,       /* Analog mux bus B */
    P10_5_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P10_5_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P10_5_TCPWM0_LINE_COMPL0        =  8,       /* Digital Active - tcpwm[0].line_compl[0]:5 */
    P10_5_TCPWM0_LINE_COMPL256      =  9,       /* Digital Active - tcpwm[0].line_compl[256]:2 */
    P10_5_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:50 */
    P10_5_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:50 */
    P10_5_LCD_COM49                 = 12,       /* Digital Deep Sleep - lcd.com[49]:0 */
    P10_5_LCD_SEG49                 = 13,       /* Digital Deep Sleep - lcd.seg[49]:0 */
    P10_5_SCB1_SPI_SELECT2          = 20,       /* Digital Active - scb[1].spi_select2:0 */
    P10_5_TCPWM0_TR_ONE_CNT_IN2     = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[2]:4 */

    /* P10.6 */
    P10_6_GPIO                      =  0,       /* GPIO controls 'out' */
    P10_6_AMUXA                     =  4,       /* Analog mux bus A */
    P10_6_AMUXB                     =  5,       /* Analog mux bus B */
    P10_6_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P10_6_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P10_6_TCPWM0_LINE1              =  8,       /* Digital Active - tcpwm[0].line[1]:5 */
    P10_6_TCPWM0_LINE257            =  9,       /* Digital Active - tcpwm[0].line[257]:2 */
    P10_6_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:51 */
    P10_6_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:51 */
    P10_6_LCD_COM50                 = 12,       /* Digital Deep Sleep - lcd.com[50]:0 */
    P10_6_LCD_SEG50                 = 13,       /* Digital Deep Sleep - lcd.seg[50]:0 */
    P10_6_SCB1_SPI_SELECT3          = 20,       /* Digital Active - scb[1].spi_select3:0 */
    P10_6_TCPWM0_TR_ONE_CNT_IN3     = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[3]:4 */
    P10_6_PERI_TR_IO_INPUT22        = 24,       /* Digital Active - peri.tr_io_input[22]:0 */

    /* P10.7 */
    P10_7_GPIO                      =  0,       /* GPIO controls 'out' */
    P10_7_AMUXA                     =  4,       /* Analog mux bus A */
    P10_7_AMUXB                     =  5,       /* Analog mux bus B */
    P10_7_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P10_7_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P10_7_TCPWM0_LINE_COMPL1        =  8,       /* Digital Active - tcpwm[0].line_compl[1]:5 */
    P10_7_TCPWM0_LINE_COMPL257      =  9,       /* Digital Active - tcpwm[0].line_compl[257]:2 */
    P10_7_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:52 */
    P10_7_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:52 */
    P10_7_LCD_COM51                 = 12,       /* Digital Deep Sleep - lcd.com[51]:0 */
    P10_7_LCD_SEG51                 = 13,       /* Digital Deep Sleep - lcd.seg[51]:0 */
    P10_7_SMIF_SPI_SELECT2          = 17,       /* Digital Active - smif.spi_select2 */
    P10_7_TCPWM0_TR_ONE_CNT_IN256   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[256]:4 */
    P10_7_PERI_TR_IO_INPUT23        = 24,       /* Digital Active - peri.tr_io_input[23]:0 */

    /* P11.1 */
    P11_1_GPIO                      =  0,       /* GPIO controls 'out' */
    P11_1_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:53 */
    P11_1_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:53 */
    P11_1_LCD_COM53                 = 12,       /* Digital Deep Sleep - lcd.com[53]:0 */
    P11_1_LCD_SEG53                 = 13,       /* Digital Deep Sleep - lcd.seg[53]:0 */
    P11_1_SMIF_SPI_SELECT1          = 17,       /* Digital Active - smif.spi_select1 */
    P11_1_TCPWM0_TR_ONE_CNT_IN257   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[257]:4 */

    /* P11.2 */
    P11_2_GPIO                      =  0,       /* GPIO controls 'out' */
    P11_2_TCPWM0_LINE3              =  8,       /* Digital Active - tcpwm[0].line[3]:5 */
    P11_2_TCPWM0_LINE259            =  9,       /* Digital Active - tcpwm[0].line[259]:2 */
    P11_2_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:54 */
    P11_2_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:54 */
    P11_2_LCD_COM54                 = 12,       /* Digital Deep Sleep - lcd.com[54]:0 */
    P11_2_LCD_SEG54                 = 13,       /* Digital Deep Sleep - lcd.seg[54]:0 */
    P11_2_SMIF_SPI_SELECT0          = 17,       /* Digital Active - smif.spi_select0 */
    P11_2_SCB5_UART_RTS             = 18,       /* Digital Active - scb[5].uart_rts:0 */
    P11_2_SCB5_SPI_CLK              = 20,       /* Digital Active - scb[5].spi_clk:0 */
    P11_2_TCPWM0_TR_ONE_CNT_IN258   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[258]:4 */

