zephyrproject-rtos/hal_infineon/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/gpio_psoc6_04_80_m_csp.h
    /* P11.3 */
    P11_3_GPIO                      =  0,       /* GPIO controls 'out' */
    P11_3_TCPWM0_LINE_COMPL3        =  8,       /* Digital Active - tcpwm[0].line_compl[3]:5 */
    P11_3_TCPWM0_LINE_COMPL259      =  9,       /* Digital Active - tcpwm[0].line_compl[259]:2 */
    P11_3_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:55 */
    P11_3_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:55 */
    P11_3_LCD_COM55                 = 12,       /* Digital Deep Sleep - lcd.com[55]:0 */
    P11_3_LCD_SEG55                 = 13,       /* Digital Deep Sleep - lcd.seg[55]:0 */
    P11_3_SMIF_SPI_DATA3            = 17,       /* Digital Active - smif.spi_data3 */
    P11_3_SCB5_UART_CTS             = 18,       /* Digital Active - scb[5].uart_cts:0 */
    P11_3_SCB5_SPI_SELECT0          = 20,       /* Digital Active - scb[5].spi_select0:0 */
    P11_3_TCPWM0_TR_ONE_CNT_IN259   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[259]:4 */
    P11_3_PERI_TR_IO_OUTPUT0        = 25,       /* Digital Active - peri.tr_io_output[0]:0 */

    /* P11.4 */
    P11_4_GPIO                      =  0,       /* GPIO controls 'out' */
    P11_4_TCPWM0_LINE0              =  8,       /* Digital Active - tcpwm[0].line[0]:6 */
    P11_4_TCPWM0_LINE260            =  9,       /* Digital Active - tcpwm[0].line[260]:3 */
    P11_4_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:56 */
    P11_4_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:56 */
    P11_4_LCD_COM56                 = 12,       /* Digital Deep Sleep - lcd.com[56]:0 */
    P11_4_LCD_SEG56                 = 13,       /* Digital Deep Sleep - lcd.seg[56]:0 */
    P11_4_SMIF_SPI_DATA2            = 17,       /* Digital Active - smif.spi_data2 */
    P11_4_SCB5_SPI_SELECT1          = 20,       /* Digital Active - scb[5].spi_select1:0 */
    P11_4_TCPWM0_TR_ONE_CNT_IN260   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[260]:4 */
    P11_4_PERI_TR_IO_OUTPUT1        = 25,       /* Digital Active - peri.tr_io_output[1]:0 */

    /* P11.5 */
    P11_5_GPIO                      =  0,       /* GPIO controls 'out' */
    P11_5_TCPWM0_LINE_COMPL0        =  8,       /* Digital Active - tcpwm[0].line_compl[0]:6 */
    P11_5_TCPWM0_LINE_COMPL260      =  9,       /* Digital Active - tcpwm[0].line_compl[260]:3 */
    P11_5_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:57 */
    P11_5_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:57 */
    P11_5_LCD_COM57                 = 12,       /* Digital Deep Sleep - lcd.com[57]:0 */
    P11_5_LCD_SEG57                 = 13,       /* Digital Deep Sleep - lcd.seg[57]:0 */
    P11_5_SMIF_SPI_DATA1            = 17,       /* Digital Active - smif.spi_data1 */
    P11_5_SCB5_SPI_SELECT2          = 20,       /* Digital Active - scb[5].spi_select2:0 */
    P11_5_TCPWM0_TR_ONE_CNT_IN261   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[261]:4 */

    /* P11.6 */
    P11_6_GPIO                      =  0,       /* GPIO controls 'out' */
    P11_6_TCPWM0_LINE1              =  8,       /* Digital Active - tcpwm[0].line[1]:6 */
    P11_6_TCPWM0_LINE261            =  9,       /* Digital Active - tcpwm[0].line[261]:3 */
    P11_6_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:58 */
    P11_6_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:58 */
    P11_6_LCD_COM58                 = 12,       /* Digital Deep Sleep - lcd.com[58]:0 */
    P11_6_LCD_SEG58                 = 13,       /* Digital Deep Sleep - lcd.seg[58]:0 */
    P11_6_SMIF_SPI_DATA0            = 17,       /* Digital Active - smif.spi_data0 */
    P11_6_SCB5_SPI_SELECT3          = 20,       /* Digital Active - scb[5].spi_select3:0 */
    P11_6_TCPWM0_TR_ONE_CNT_IN262   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[262]:4 */

    /* P11.7 */
    P11_7_GPIO                      =  0,       /* GPIO controls 'out' */
    P11_7_TCPWM0_LINE_COMPL1        =  8,       /* Digital Active - tcpwm[0].line_compl[1]:6 */
    P11_7_TCPWM0_LINE_COMPL261      =  9,       /* Digital Active - tcpwm[0].line_compl[261]:2 */
    P11_7_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:59 */
    P11_7_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:59 */
    P11_7_LCD_COM59                 = 12,       /* Digital Deep Sleep - lcd.com[59]:0 */
    P11_7_LCD_SEG59                 = 13,       /* Digital Deep Sleep - lcd.seg[59]:0 */
    P11_7_SMIF_SPI_CLK              = 17,       /* Digital Active - smif.spi_clk */
    P11_7_TCPWM0_TR_ONE_CNT_IN263   = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[263]:4 */

    /* P12.6 */
    P12_6_GPIO                      =  0,       /* GPIO controls 'out' */
    P12_6_TCPWM0_LINE3              =  8,       /* Digital Active - tcpwm[0].line[3]:6 */
    P12_6_TCPWM0_LINE263            =  9,       /* Digital Active - tcpwm[0].line[263]:3 */
    P12_6_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:60 */
    P12_6_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:60 */
    P12_6_LCD_COM2                  = 12,       /* Digital Deep Sleep - lcd.com[2]:1 */
    P12_6_LCD_SEG2                  = 13,       /* Digital Deep Sleep - lcd.seg[2]:1 */
    P12_6_TCPWM0_TR_ONE_CNT_IN0     = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[0]:5 */

    /* P12.7 */
    P12_7_GPIO                      =  0,       /* GPIO controls 'out' */
    P12_7_TCPWM0_LINE_COMPL3        =  8,       /* Digital Active - tcpwm[0].line_compl[3]:6 */
    P12_7_TCPWM0_LINE_COMPL263      =  9,       /* Digital Active - tcpwm[0].line_compl[263]:3 */
    P12_7_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:61 */
    P12_7_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:61 */
    P12_7_LCD_COM3                  = 12,       /* Digital Deep Sleep - lcd.com[3]:1 */
    P12_7_LCD_SEG3                  = 13,       /* Digital Deep Sleep - lcd.seg[3]:1 */
    P12_7_TCPWM0_TR_ONE_CNT_IN1     = 23,       /* Digital Active - tcpwm[0].tr_one_cnt_in[1]:5 */

    /* USBDP */
    USBDP_GPIO                      =  0,       /* GPIO controls 'out' */

    /* USBDM */
    USBDM_GPIO                      =  0        /* GPIO controls 'out' */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC6_04_80_M_CSP_H_ */


/* [] END OF FILE */
